<font color="blue">To use this notebook on Colaboratory, you will need to make a copy of it. Go to File > Save a Copy in Drive. You can then use the new copy that will appear in the new tab.</font>

# Data Wrangling with Python

## Pre-requisites

In [1]:
# Pre-requisite 1
# ---
# The first thing that we will do in this notebook is 
# to import the pandas library for data manipulation.
# ---
# OUR CODE GOES BELOW
# 
import pandas as pd

In [2]:
# Pre-requisite 2
# ---
# We will also import the numpy library which
# will allow us to perform scientific computations.
# ---
# For those who are not familiar with what a library is,
# A library is a collection of related pieces of code that 
# have been compiled and stored together for reuse.
# ---
# OUR CODE GOES BELOW
# 
import numpy as np

## 1. Reading Data

In [6]:
# Example 1
# --- 
# Loading a dataset (csv file) from a url 
# ---
# Dataset url (csv file) = http://bit.ly/IrisDataset
# ---
# OUR CODE GOES BELOW
# 

# Reading our csv file from the given url and storing it to a dataframe.
# A data frame is a two-dimensional data structure that is used to 
# represent a table of data with rows and columns.
# ---
#
df = pd.read_csv("http://bit.ly/IrisDataset")
df.to_csv(r'D:\Tellymarks\Data Classes\cities.csv',index=False,header=True)
# Previewing the first 5 records
df.head()

   sepal_length  sepal_width  petal_length  petal_width      species
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa

In [8]:
# Example 2
# ---
# We can also load A CSV Into pandas as shown below
# ---
# Dataset url = http://bit.ly/CitiesDataset1
# ----
# Instructions:
# 1. Visit the above dataset url with a browser. Then download the file.
# 2. Within this notebook you will need to have the Table of contents left sidebar open.
#    If its not open, you can open the sidebar clicking at the top of the notebook View -> Table of Contents.
# 3. Once its open click on the Files tab within the sidebar (this is on the farmost right).
# 4. Then upload the downloaded file to this location/ Or drag the file
# 5. Once uploaded you will use the name of the file to open the file as shown below. 
#    You can also store in a directory/folder then reference that directory while reading the file.
#    i.e. the file cities stored in a directory named finance, then the reference pd.read_csv("/finance/cities.csv")
# ---
# 

# Let's read the cities csv file
df_cities = pd.read_csv("../cities.csv")

# Previewing the first five records
df_cities.head()

   sepal_length  sepal_width  petal_length  petal_width      species
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa

In [5]:
# Challenge 1a
# ---
# Question: Load the following hotels dataset and preview the first 5 records.
# Hint: Use a different dataframe that the one used in the example dataset 
#       i.e. using the dataframe name "hotel_df" rather using the dataframe name "df"
#       If you use the same dataframe names for the examples and challenges you 
#       might experience a crash.
#       We will be using this dataset for most of the challenges.
#     : To work quickly on theses challenges, copy paste example code and modify the your need. 
# ---
# Dataset url (csv file) = https://bit.ly/HotelBookingsDB
# This data set contains booking information for a city hotel and a resort hotel, 
# and includes information such as when the booking was made, length of stay, 
# the number of adults, children, and/or babies, and the number of available 
# parking spaces, among other things.
# ---
# OUR CODE GOES BELOW
#

In [3]:
# Challenge 1b
# ---
# Question: Load a dataset (excel file) from the url below
# Hint: - Use the read_excel() function rather than using the read_csv() function
#       - Use a new dataframe windmill_df
# ---
# Dataset url = http://bit.ly/WindmillDataset
# ---
# OUR CODE GOES BELOW
#
import pandas as pd
df = pd.read_excel('http://bit.ly/WindmillDataset')
df

    Windmill  Wind Speed (m/s)  Power output (MW)
0         a1          1.096875           0.000000
1         a2          1.231528           0.000000
2         a3          1.275139           0.005479
3         a4          1.365486           0.010104
4         a5          1.387778           0.010812
..       ...               ...                ...
360     a361         15.247639          27.502063
361     a362         15.267847          28.577500
362     a363         16.346944          29.009979
363     a364         16.575833          22.852229
364     a365         18.316389          29.020937

[365 rows x 3 columns]

## 2. Data Exploration

In [7]:
# Example 2a
# ---
# Determining the no. of records in the dataset 
# NB: We will use the above loaded dataset in example 1
# ---
# OUR CODE GOES BELOW
#

# Shape returns no. or records/instances (left) and columns/variables (right)
#
df.shape

(150, 5)

In [8]:
# Challenge 2a
# ---
# Question: Determine the no. of records in the our hotels dataset.
# NB: last() gives us the last 5 records/instances
# ---  
# OUR CODE GOES BELOW
#

In [9]:
# Example 2b
# ---
# Previewing the last few records/instances of our dataset
# ---
# OUR CODE GOES BELOW
#
df.tail()

     sepal_length  sepal_width  petal_length  petal_width         species
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

In [10]:
# Challenge 2c
# ---
# Question: Preview the last few records in the hotels dataset.
# Hint = Use the dataframe you created for this dataset. 
# ---
# OUR CODE GOES BELOW
#

In [11]:
# Challenge 2d
# ---
# Question: Preview a sample of 10 records from the hotels dataset.
# Hint: Use the dataframe you created for this dataset. 
#     : Use the sample() function, and add no. of desired records as the parameter.
# ---
# OUR CODE GOES BELOW
#

In [12]:
# Example 2c
# ---
# Checking the datatypes of df variables (columns)
# --- 
# OUR CODE GOES BELOW
#
df.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

In [13]:
# Challenge 2e
# ---
# Question: Check the datatypes of the hotels dataset.
# ---
# OUR CODE GOES BELOW
#

## 3. Standardisation

#### <font color="blue">Examples</font>

In [11]:
# Example 1
# --- 
# Renaming column names
# ---
# Dataset url = http://bit.ly/DataCleaningDataset
# ---
# OUR CODE GOES BELOW
# 

# Reading our dataset from the url 
# ---
# 
df = pd.read_csv('http://bit.ly/DataCleaningDataset')
df.head()

  NAME;CITY;COUNTRY;HEIGHT;WEIGHT;ACCOUNT A;ACCOUNT B;TOTAL ACCOUNT
0  Adi Dako ;LISBON    ;PORTUGAL     ;56;132;2390...
1  John Paul;LONDON   ;UNITED KINGDOM;62;165;4500...
2     Cindy Jules;Stockholm;Sweden;48;117;;5504;8949
3      Arthur Kegels;BRUSSELS;BELGIUM;59;121;4344...
4  Freya Bismark;  Berlin;GERMANYY;53;126;7000;19...

In [21]:
# We specify the character ; as our separator so that we can 
# be able to ready the above file that has ";" as a separator 
# for our columns. We should note that many dataset may note have
# such a structure, but if we come across this kind of a scenario
# this is how we would read our file.
# ---
# 
df = pd.read_csv('http://bit.ly/DataCleaningDataset', sep=';')
df.head()

,NAME,CITY,COUNTRY,HEIGHT,WEIGHT,ACCOUNT A,ACCOUNT B,TOTAL ACCOUNT
0,Adi Dako,LISBON,PORTUGAL,56,132.0,2390.0,4340,6730
1,John Paul,LONDON,UNITED KINGDOM,62,165.0,4500.0,34334,38834
2,Cindy Jules,Stockholm,Sweden,48,117.0,NaN,5504,8949
3,Arthur Kegels,BRUSSELS,BELGIUM,59,121.0,4344.0,8999,300
4,Freya Bismark,Berlin,GERMANYY,53,126.0,7000.0,19000,26000

In [5]:
df.dtypes

NAME              object
CITY              object
COUNTRY           object
HEIGHT             int64
WEIGHT           float64
ACCOUNT A        float64
ACCOUNT B          int64
TOTAL ACCOUNT      int64
dtype: object

In [16]:
df['NAME'][0]

'Adi Dako '

In [18]:
type(df.NAME[0])

str

In [19]:
df.columns.str.lower().str.replace(' ','_')

Index(['name', 'city', 'country', 'height', 'weight', 'account_a', 'account_b',
       'total_account'],
      dtype='object')

In [22]:
df.columns[0].lower()

'name'

In [87]:
# Example 1a
# --- 
# We now rename our columns.
# We can use this method if we have many column names.
# We will use the str.strip(), str.lower(), str.replace() functions 
# to ensure that our column names are in lowercase format that we easily 
# reference while performing further analysis.
# ---
# str.strip() - This fuction is used to remove leading and trailing characters.
# str.lower() - This function is used to convert all characters to lowercase
# str.replace() - This fuction is used to replace text with some other text.
# ---
#
df.columns = df.columns.str.strip().str.lower().str.replace(' ', '_').str.replace('(', '').str.replace(')', '')

# Then preview our resulting dataframe
# ---
df.head()

,name,city,country,height,weight,account_a,account_b,total_account
0,Adi Dako,LISBON,PORTUGAL,56,132.0,2390.0,4340,6730
1,John Paul,LONDON,UNITED KINGDOM,62,165.0,4500.0,34334,38834
2,Cindy Jules,Stockholm,Sweden,48,117.0,NaN,5504,8949
3,Arthur Kegels,BRUSSELS,BELGIUM,59,121.0,4344.0,8999,300
4,Freya Bismark,Berlin,GERMANYY,53,126.0,7000.0,19000,26000

In [12]:
# Example 1b
# ---
# Alternatively, we can rename column names in a dataframe manually by 
# specifying new column names that would replace the original column names.
# You should note that this method is cumbersome when 
# the no. of features/varibles/columns become large.
# ---
#

# To demonstrate this, we will need to import our dataset again 
# so that we work with our original dataset. 
# ---
# 
df = pd.read_csv('http://bit.ly/DataCleaningDataset', ';') 

# We then specify our columns names, store them in a list, then afterwards
# assign this list to the original column names. 

# Lets first see our original column names below
# ---
# 
df.columns

C:\Users\Huzaifa\AppData\Local\Temp\ipykernel_6268\1095624253.py:14: FutureWarning: In a future version of pandas all arguments of read_csv except for the argument 'filepath_or_buffer' will be keyword-only.
  df = pd.read_csv('http://bit.ly/DataCleaningDataset', ';')

Index(['NAME', 'CITY', 'COUNTRY', 'HEIGHT', 'WEIGHT', 'ACCOUNT A', 'ACCOUNT B',
       'TOTAL ACCOUNT'],
      dtype='object')

In [13]:
df['NAME']

0            Adi Dako
1            John Paul
2          Cindy Jules
3        Arthur Kegels
4        Freya Bismark
5           Rena Filip
6          Cindy Jules
7            John Paul
Name: NAME, dtype: object

In [14]:
l1 = [1,2,3,4]
l2 = l1.copy()
l2.append(5)
l1

[1, 2, 3, 4]

In [15]:
l2

[1, 2, 3, 4, 5]

In [22]:
type(df['NAME'])

pandas.core.series.Series

In [22]:
df['NAME'] = df['NAME'].str.replace('Adi Dako','Majid Dako')
df.head()

,NAME,CITY,COUNTRY,HEIGHT,WEIGHT,ACCOUNT A,ACCOUNT B,TOTAL ACCOUNT
0,Majid Dako,LISBON,PORTUGAL,56,132.0,2390.0,4340,6730
1,John Paul,LONDON,UNITED KINGDOM,62,165.0,4500.0,34334,38834
2,Cindy Jules,Stockholm,Sweden,48,117.0,NaN,5504,8949
3,Arthur Kegels,BRUSSELS,BELGIUM,59,121.0,4344.0,8999,300
4,Freya Bismark,Berlin,GERMANYY,53,126.0,7000.0,19000,26000

In [50]:
# We then perform our column values replacement as shown below
# ---
# 
df.columns = ['name', 'city', 'country', 'height', 'weight', 'account_a', 'account_b', 'total_account']

# We then preview our dataframe as shown 
# ---
#
df.head()

,name,city,country,height,weight,account_a,account_b,total_account
0,Majid Dako,LISBON,PORTUGAL,56,132.0,2390.0,4340,6730
1,John Paul,LONDON,UNITED KINGDOM,62,165.0,4500.0,34334,38834
2,Cindy Jules,Stockholm,Sweden,48,117.0,NaN,5504,8949
3,Arthur Kegels,BRUSSELS,BELGIUM,59,121.0,4344.0,8999,300
4,Freya Bismark,Berlin,GERMANYY,53,126.0,7000.0,19000,26000

In [51]:
# Example 2
# ---
# We can also perform string conversion to a particular column. 
# This allows us to have uniformity across all values of a column.
# In this example, we will convert the values of the column "city" to lower case values.
# ---
# OUR CODE GOES BELOW
# 

# Lets convert the city column to comprise of only lowercase characters
# ---
# 
df['city'] = df['city'].str.lower()
df.head()

,name,city,country,height,weight,account_a,account_b,total_account
0,Majid Dako,lisbon,PORTUGAL,56,132.0,2390.0,4340,6730
1,John Paul,london,UNITED KINGDOM,62,165.0,4500.0,34334,38834
2,Cindy Jules,stockholm,Sweden,48,117.0,NaN,5504,8949
3,Arthur Kegels,brussels,BELGIUM,59,121.0,4344.0,8999,300
4,Freya Bismark,berlin,GERMANYY,53,126.0,7000.0,19000,26000

In [20]:
# Example 3
# ---
# We can also perform types of conversion that we would want i.e. metric conversion.
# In this example, we will convert our height values to centimeters noting 
# that 1 inch = 2.54 cm.
# ---
# Dataset url = http://bit.ly/DataCleaningDataset
# ---
# 

# We can perform our conversion across the column that we would want 
# then replace the column with the outcome of our conversion.
# ---
#
df['height'] = df['height'] * 2.54
df.head()

,name,city,country,height,weight,account_a,account_b,total_account
0,Adi Dako,lisbon,PORTUGAL,142.24,132.0,2390.0,4340,6730
1,John Paul,london,UNITED KINGDOM,157.48,165.0,4500.0,34334,38834
2,Cindy Jules,stockholm,Sweden,121.92,117.0,NaN,5504,8949
3,Arthur Kegels,brussels,BELGIUM,149.86,121.0,4344.0,8999,300
4,Freya Bismark,berlin,GERMANYY,134.62,126.0,7000.0,19000,26000

In [54]:
df.shape

(8, 9)

In [53]:
df['height_cm'] = df['height'] * 2.54

In [55]:
# Example 4
# ---
# We can also perform other types of conversion such as datatype conversion as shown
# in the next cell.
# ---


# But before we do that, let's first determine the column/feature datatypes
# ---
# 
df.dtypes

name              object
city              object
country           object
height             int64
weight           float64
account_a        float64
account_b          int64
total_account      int64
height_cm        float64
dtype: object

In [57]:
df.head()

,name,city,country,height,weight,account_a,account_b,total_account,height_cm
0,Majid Dako,lisbon,PORTUGAL,56,132.0,2390.0,4340,6730,142.24
1,John Paul,london,UNITED KINGDOM,62,165.0,4500.0,34334,38834,157.48
2,Cindy Jules,stockholm,Sweden,48,117.0,NaN,5504,8949,121.92
3,Arthur Kegels,brussels,BELGIUM,59,121.0,4344.0,8999,300,149.86
4,Freya Bismark,berlin,GERMANYY,53,126.0,7000.0,19000,26000,134.62

In [59]:
# Then perform a conversion by converting our column/feature 
# through the use of the apply() function, passing the numerical 
# type provided by numpy.
# To get an understanding of other datatypes provided by numpy we can visit: 
# https://docs.scipy.org/doc/numpy/user/basics.types.html
# ---
# Other 
# ---
# 
df['height'] = df['height'].apply(np.int64)

# Let's now check whether our conversion happened by checking our updated datatypes
# ---
# 
df.dtypes

name              object
city              object
country           object
height             int64
weight           float64
account_a        float64
account_b          int64
total_account      int64
height_cm        float64
dtype: object

#### <font color="green">Challenges</font>

In [23]:
# Challenge 1
# ---
# Question: Convert the variables account_a and account_b to integer datatype.
# ---
# Hint: You can refer to the df dataframe in the example. 
# ---
# OUR CODE GOES BELOW
#

In [24]:
# Challenge 2
# ---
# Question: Convert the given weight feature in the dataset from pounds to grams. 
# ---
# Hint: 1 pound = 453.592 grams 
#     : You can refer to the df dataframe in the example. 
# ---
# ---
# OUR CODE GOES BELOW
#

## 4. Syntax Errors

#### <font color="blue">Examples</font>

In [25]:
# Example 1
# --- 
# While performing our analysis, we can get to a point where we need to 
# fix spelling mistakes or typos. This example will show us how we can 
# go about this.
# ---
# Dataset url = http://bit.ly/DataCleaningDataset
# ---
# OUR CODE GOES BELOW
# 

# Let's replacing any value "GERMANYY" with the correct value "GERMANY".
# We use the string replace() function to perform our operation as shown.
# ---
# 
df['country'] = df['country'].str.replace('GERMANYY', 'GERMANY')
df.head()

,name,city,country,height,weight,account_a,account_b,total_account
0,Adi Dako,lisbon,PORTUGAL,142,132.0,2390.0,4340,6730
1,John Paul,london,UNITED KINGDOM,157,165.0,4500.0,34334,38834
2,Cindy Jules,stockholm,Sweden,121,117.0,NaN,5504,8949
3,Arthur Kegels,brussels,BELGIUM,149,121.0,4344.0,8999,300
4,Freya Bismark,berlin,GERMANY,134,126.0,7000.0,19000,26000

In [26]:
# Example 2
# ---
# We can also decide to strip or remove leading spaces (space infront) 
# and trailing spaces (spaces at the end) by using the string strip() function
# covered in this example.
# ---
# Dataset = http://bit.ly/DataCleaningDataset
# ---
# OUR CODE GOES BELOW
# 

# We first load our dataframe column with the intention to observing leading 
# and trailing spaces in the city column
# ---
# 
df['city']

0           lisbon
1            london
2            stockholm
3             brussels
4               berlin
5         brasilia
6            stockholm
7            london
Name: city, dtype: object

In [27]:
# Then later we strip the leading and trailing spaces as shown and lastly 
# confirm our changes  
# ---
# 
df['city'] = df['city'].str.strip()
df['city']

0       lisbon
1       london
2    stockholm
3     brussels
4       berlin
5     brasilia
6    stockholm
7       london
Name: city, dtype: object

#### <font color="green">Challenges</font>

In [28]:
# Challenge 1
# ---
# Question: Deal with the leading and trailing whitespaces from Name 
# and Team variables in the following dataset.
# ---
# Dataset url = http://bit.ly/NBABasketballDataset
# ---
# OUR CODE GOES BELOW
#

## 5. Irrelevant Data

#### <font color="blue">Examples</font>

In [29]:
# Example 1
# --- 
# We can also deleting/dropping irrelevant columns/features. 
# By irrelevant we mean dataset features that we don't need 
# to answer a research question. 
# ---
# Dataset url = http://bit.ly/DataCleaningDataset
# Hint: Use the df dataframe you created earlier
# ---
# OUR CODE GOES BELOW
#

In [26]:
df = pd.read_csv('http://bit.ly/DataCleaningDataset', ';')

C:\Users\Huzaifa\AppData\Local\Temp\ipykernel_6268\1866208534.py:1: FutureWarning: In a future version of pandas all arguments of read_csv except for the argument 'filepath_or_buffer' will be keyword-only.
  df = pd.read_csv('http://bit.ly/DataCleaningDataset', ';')

In [27]:
df.head()

,NAME,CITY,COUNTRY,HEIGHT,WEIGHT,ACCOUNT A,ACCOUNT B,TOTAL ACCOUNT
0,Adi Dako,LISBON,PORTUGAL,56,132.0,2390.0,4340,6730
1,John Paul,LONDON,UNITED KINGDOM,62,165.0,4500.0,34334,38834
2,Cindy Jules,Stockholm,Sweden,48,117.0,NaN,5504,8949
3,Arthur Kegels,BRUSSELS,BELGIUM,59,121.0,4344.0,8999,300
4,Freya Bismark,Berlin,GERMANYY,53,126.0,7000.0,19000,26000

In [23]:
# Deleting an Irrelevant Column i.e. if we didn't require the column city 
# to answer our research question.
# ---
# While dropping/deleting those two columns:
# a) We set axis = 1
#    A dataframe has two axes: â€œaxis 0â€ and â€œaxis 1â€. 
#    â€œaxis 0â€ represents rows and â€œaxis 1â€ represents columns.
# b) We can also set Inplace = True.
#    This means the changes would be made to the original dataframe.
# Dropping the irrelevant columns i.e. Team and Weight
# Those values were dropped since axis was set equal to 1 and 
# the changes were made in the original data frame since inplace was True.
# 
df.drop(["CITY"], axis = 1, inplace = True) 
 
# And preview our resulting dataset
# ---
# 
df

,NAME,COUNTRY,HEIGHT,WEIGHT,ACCOUNT A,ACCOUNT B,TOTAL ACCOUNT
0,Majid Dako,PORTUGAL,56,132.0,2390.0,4340,6730
1,John Paul,UNITED KINGDOM,62,165.0,4500.0,34334,38834
2,Cindy Jules,Sweden,48,117.0,NaN,5504,8949
3,Arthur Kegels,BELGIUM,59,121.0,4344.0,8999,300
4,Freya Bismark,GERMANYY,53,126.0,7000.0,19000,26000
5,Rena Filip,BRAZIL,50,167.0,4999.0,3999,3450
6,Cindy Jules,Sweden,48,117.0,3445.0,5504,8949
7,John Paul,UNITED KINGDOM,62,NaN,4500.0,2300,6800

In [30]:
# We can drop multiple columns as shown
# ---
# 
df.drop(["HEIGHT", "WEIGHT"], axis = 1, inplace = True) 

# And preview our resulting dataset 
# --- 
# 
df.head()
df.to_csv("neglectIrrelevantData.csv",index = False)

In [31]:
remapped_data = pd.read_csv("neglectIrrelevantData.csv")
remapped_data

                NAME         COUNTRY  ACCOUNT A  ACCOUNT B  TOTAL ACCOUNT
0          Adi Dako    PORTUGAL          2390.0       4340           6730
1          John Paul  UNITED KINGDOM     4500.0      34334          38834
2        Cindy Jules          Sweden        NaN       5504           8949
3      Arthur Kegels         BELGIUM     4344.0       8999            300
4      Freya Bismark        GERMANYY     7000.0      19000          26000
5         Rena Filip          BRAZIL     4999.0       3999           3450
6        Cindy Jules          Sweden     3445.0       5504           8949
7          John Paul  UNITED KINGDOM     4500.0       2300           6800

In [34]:
# Example 2
# ---
# We can also fix in-record & cross-datasets errors. 
# These kinds errors result from having two or more values in the same row 
# or across datasets contradicting with each other.
# ---
# Dataset = http://bit.ly/DataCleaningDataset
# ---
# OUR CODE GOES BELOW
# 
df['TOTAL ACCOUNT 2'] = df['ACCOUNT A'] + df['ACCOUNT B']

# Previewing our resulting dataframe 
# ---
#
df.head()

,NAME,COUNTRY,ACCOUNT A,ACCOUNT B,TOTAL ACCOUNT,TOTAL ACCOUNT 2
0,Adi Dako,PORTUGAL,2390.0,4340,6730,6730.0
1,John Paul,UNITED KINGDOM,4500.0,34334,38834,38834.0
2,Cindy Jules,Sweden,NaN,5504,8949,NaN
3,Arthur Kegels,BELGIUM,4344.0,8999,300,13343.0
4,Freya Bismark,GERMANYY,7000.0,19000,26000,26000.0

In [36]:
# Create another column to tell us whether if the two columns match.
# We will use the numpy library through use of np.
# ---
# 
df['TOTAL ACCOUNT?'] = np.where(df['TOTAL ACCOUNT'] == df['TOTAL ACCOUNT 2'], 'True', 'False')

# Previewing our resulting dataframe 
# ---
# 
df.head(10)

,NAME,COUNTRY,ACCOUNT A,ACCOUNT B,TOTAL ACCOUNT,TOTAL ACCOUNT 2,TOTAL ACCOUNT?
0,Adi Dako,PORTUGAL,2390.0,4340,6730,6730.0,True
1,John Paul,UNITED KINGDOM,4500.0,34334,38834,38834.0,True
2,Cindy Jules,Sweden,NaN,5504,8949,NaN,False
3,Arthur Kegels,BELGIUM,4344.0,8999,300,13343.0,False
4,Freya Bismark,GERMANYY,7000.0,19000,26000,26000.0,True
5,Rena Filip,BRAZIL,4999.0,3999,3450,8998.0,False
6,Cindy Jules,Sweden,3445.0,5504,8949,8949.0,True
7,John Paul,UNITED KINGDOM,4500.0,2300,6800,6800.0,True

In [ ]:
# df.loc
# df.ilco

In [24]:
df.loc[(df['COUNTRY'] == "Sweden")]

          NAME COUNTRY  HEIGHT  WEIGHT  ACCOUNT A  ACCOUNT B  TOTAL ACCOUNT
2  Cindy Jules  Sweden      48   117.0        NaN       5504           8949
6  Cindy Jules  Sweden      48   117.0     3445.0       5504           8949

In [25]:
df.loc[(df['COUNTRY'] == "Sweden") & (df['ACCOUNT A'] > 2390)]

          NAME COUNTRY  HEIGHT  WEIGHT  ACCOUNT A  ACCOUNT B  TOTAL ACCOUNT
6  Cindy Jules  Sweden      48   117.0     3445.0       5504           8949

In [27]:
pd.DataFrame(df.iloc[[0,2],1])
# df.iloc[[0,2],1]

         COUNTRY
0  PORTUGAL
2         Sweden

In [44]:
df

,NAME,COUNTRY,ACCOUNT A,ACCOUNT B,TOTAL ACCOUNT,TOTAL ACCOUNT 2,TOTAL ACCOUNT?
0,Adi Dako,PORTUGAL,2390.0,4340,6730,6730.0,True
1,John Paul,UNITED KINGDOM,4500.0,34334,38834,38834.0,True
2,Cindy Jules,Sweden,NaN,5504,8949,NaN,False
3,Arthur Kegels,BELGIUM,4344.0,8999,300,13343.0,False
4,Freya Bismark,GERMANYY,7000.0,19000,26000,26000.0,True
5,Rena Filip,BRAZIL,4999.0,3999,3450,8998.0,False
6,Cindy Jules,Sweden,3445.0,5504,8949,8949.0,True
7,John Paul,UNITED KINGDOM,4500.0,2300,6800,6800.0,True

In [45]:
# Let's now select the records which don't match 
# ---
# 
df.loc[df['TOTAL ACCOUNT?'] == "False"]

,NAME,COUNTRY,ACCOUNT A,ACCOUNT B,TOTAL ACCOUNT,TOTAL ACCOUNT 2,TOTAL ACCOUNT?
2,Cindy Jules,Sweden,NaN,5504,8949,NaN,False
3,Arthur Kegels,BELGIUM,4344.0,8999,300,13343.0,False
5,Rena Filip,BRAZIL,4999.0,3999,3450,8998.0,False

#### <font color="green">Challenges</font>

In [36]:
# Challenge 1
# ---
# Question: While perfoming some analysis to answer a research question, 
# we realize that we don't need the Date and Time features in our dataset. 
# Let's drop those two features below
# ---
# Dataset url = https://bit.ly/SuperMarketSalesDB
# ---
# OUR CODE GOES BELOW
#

## 6. Duplicates

#### <font color="blue">Examples</font>

In [49]:
# Example 1
# --- 
# Finding duplicate records
# -> Duplicate records are repeated records in a dataset.
# ---
# Dataset url = http://bit.ly/NBABasketballDataset
# ---
# OUR CODE GOES BELOW
# 

nba_df = pd.read_csv('http://bit.ly/NBABasketballDataset')
 
# Again, we first explore our dataset by determining the shape of 
# our dataset (records/instances, columns/variables)
# ---
# 
nba_df.shape

(458, 9)

In [50]:
nba_df

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,oston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [51]:
nba_df[nba_df.duplicated(['Team'])]

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
5,Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
6,Jordan Mickey,oston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
...,...,...,...,...,...,...,...,...,...
452,Trey Lyles,Utah Jazz,41.0,PF,20.0,6-10,234.0,Kentucky,2239800.0
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0

#### <font color="green">Challenges</font>

In [43]:
# Challenge 1
# ---
# Question: Find the duplicates in the following dataset.
# ---
# Dataset url = https://bit.ly/ShoprityDS 
# ---
# OUR CODE GOES BELOW
#

In [44]:
# Challenge 2
# ---
# Question: From your understanding of the features, deal with the duplicates found in the given dataset.
# ---
# Dataset url = https://bit.ly/ShoprityDS
# ---
# OUR CODE GOES BELOW
#

## 7. Missing Data

#### <font color="blue">Examples</font>

In [54]:
# Example 3a
# ---
# Checking for missing data
# NB: This method may not be the most convenient. Why? 
# --- 
# We can check if there is any missing values in the entire dataframe as shown 
# ---
# OUR CODE GOES BELOW
# 
df.isnull()

,NAME,COUNTRY,ACCOUNT A,ACCOUNT B,TOTAL ACCOUNT,TOTAL ACCOUNT 2,TOTAL ACCOUNT?
0,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False
2,False,False,True,False,False,True,False
3,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False
5,False,False,False,False,False,False,False
6,False,False,False,False,False,False,False
7,False,False,False,False,False,False,False

In [55]:
# Example 3b
# --- 
# We can also check for missing values in each column 
# ---
# OUR CODE GOES BELOW
#
df.isnull().any()

NAME               False
COUNTRY            False
ACCOUNT A           True
ACCOUNT B          False
TOTAL ACCOUNT      False
TOTAL ACCOUNT 2     True
TOTAL ACCOUNT?     False
dtype: bool

In [56]:
# Example 3c
# ---
# We can check how many missing values there are across each column by 
# ---
# OUR CODE GOES BELOW
#
df.isnull().sum()

NAME               0
COUNTRY            0
ACCOUNT A          1
ACCOUNT B          0
TOTAL ACCOUNT      0
TOTAL ACCOUNT 2    1
TOTAL ACCOUNT?     0
dtype: int64

In [57]:
# Example 3d
# ---
# We can also check to see if we have any missing values in the dataframe  
# ---
# OUR CODE GOES BELOW
#
print(df.isnull().values.any())

True

In [58]:
# Example 3e: Method 1
# ---
# Dealing with the missing data
# ---
# OUR CODE GOES BELOW
# 

# We can drop the missing observations 
# ---
#
df_no_missing = df.dropna()

# Checking for missing data
df_no_missing.isnull().sum()

NAME               0
COUNTRY            0
ACCOUNT A          0
ACCOUNT B          0
TOTAL ACCOUNT      0
TOTAL ACCOUNT 2    0
TOTAL ACCOUNT?     0
dtype: int64

In [59]:
# Example 3e: Method 2
# ---
# We can drop rows where all cells in that row is NA
# ---
# OUR CODE GOES BELOW
# 
df_cleaned = df.dropna(how='all')

# Checking the shape of our dataset
df_cleaned.shape

(8, 7)

In [60]:
# Example 3e: Method 3
# ---
# We could drop columns if they only contain missing values
# ---
# OUR CODE GOES BELOW
# 
df_without_columns = df.dropna(axis=1, how='all')

# Checking the shape of our dataset
df_without_columns.shape

(8, 7)

In [61]:
# Example 3e: Method 4
# ---
# We could drop rows that contain less than five observations
# ---
# OUR CODE GOES BELOW
# 
df.dropna(thresh=5)

# Checking the shape of our dataset
df.shape


# Further reading
# ----
# Above are only a few methods of dealing with missing data.

(8, 7)

#### <font color="green">Challenges</font>

In [53]:
# Challenge 3a
# ---
# Question: Find the missing values in the following datset.
# You can use any of the above methods to you see fit.
# ---
# Dataset url = https://bit.ly/ShoprityDS
# ---  
# OUR CODE GOES BELOW
#

In [54]:
# Challenge 3b
# ---
# Question: Handle the missing values in the following dataset.
# You can any of the above methods that you see fit.
# ---
# Dataset url = https://bit.ly/ShoprityDS
# ---
# OUR CODE GOES BELOW
#

## 8. Filtering

#### <font color="blue">Examples & Challenges</font>

In [179]:
# Example 4a
# ---
# Selecting rows when columns contain certain values
# ---
# NB: Selecting records where petal_length is 5.0 
# ---
# OUR CODE GOES BELOW
# 

# Reading our csv file from the given url and storing it to a dataframe.
iris_df = pd.read_csv("http://bit.ly/IrisDataset")

# Previewing the first 5 records
iris_df.head()

   sepal_length  sepal_width  petal_length  petal_width      species
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa

In [180]:
# Selecting the records where column has certain values 
# ---
#
iris_df[iris_df.petal_length.isin(['5.0'])]

     sepal_length  sepal_width  petal_length  petal_width          species
77            6.7          3.0           5.0          1.7  Iris-versicolor
113           5.7          2.5           5.0          2.0   Iris-virginica
119           6.0          2.2           5.0          1.5   Iris-virginica
146           6.3          2.5           5.0          1.9   Iris-virginica

In [181]:
# Challenge 4a
# ---
# Question: From the given dataset, find observations with outlets
# established in 2002.
# ---
# Dataset url = https://bit.ly/ShoprityDS
# ---
# OUR CODE GOES BELOW
#

In [182]:
# Example 4b
# ---
# Selecting the records where column doesn't have certain values 
# in our case, where petal_leghth is not 5.0
# ---
# OUR CODE GOES BELOW
# 

iris_df[~iris_df.petal_length.isin(['5.0'])]

     sepal_length  sepal_width  petal_length  petal_width         species
0             5.1          3.5           1.4          0.2     Iris-setosa
1             4.9          3.0           1.4          0.2     Iris-setosa
2             4.7          3.2           1.3          0.2     Iris-setosa
3             4.6          3.1           1.5          0.2     Iris-setosa
4             5.0          3.6           1.4          0.2     Iris-setosa
..            ...          ...           ...          ...             ...
144           6.7          3.3           5.7          2.5  Iris-virginica
145           6.7          3.0           5.2          2.3  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

[146 rows x 5 columns]

In [183]:
# Challenge 4b
# ---
# Question: Select all the Dairy observations from the given dataset.
# ---
# Dataset url = https://bit.ly/ShoprityDS
# ---
# OUR CODE GOES BELOW
#

In [184]:
# Example 4c
# ---
# Selecting records using filters where petal_width greater than 1.9
# ---
# OUR CODE GOES BELOW
# 

iris_df[(iris_df['petal_width'] > 1.9)]

     sepal_length  sepal_width  petal_length  petal_width         species
100           6.3          3.3           6.0          2.5  Iris-virginica
102           7.1          3.0           5.9          2.1  Iris-virginica
104           6.5          3.0           5.8          2.2  Iris-virginica
105           7.6          3.0           6.6          2.1  Iris-virginica
109           7.2          3.6           6.1          2.5  Iris-virginica
110           6.5          3.2           5.1          2.0  Iris-virginica
112           6.8          3.0           5.5          2.1  Iris-virginica
113           5.7          2.5           5.0          2.0  Iris-virginica
114           5.8          2.8           5.1          2.4  Iris-virginica
115           6.4          3.2           5.3          2.3  Iris-virginica
117           7.7          3.8           6.7          2.2  Iris-virginica
118           7.7          2.6           6.9          2.3  Iris-virginica
120           6.9          3.2           5.7          2.3  Iris-virginica
121           5.6          2.8           4.9          2.0  Iris-virginica
122           7.7          2.8           6.7          2.0  Iris-virginica
124           6.7          3.3           5.7          2.1  Iris-virginica
128           6.4          2.8           5.6          2.1  Iris-virginica
131           7.9          3.8           6.4          2.0  Iris-virginica
132           6.4          2.8           5.6          2.2  Iris-virginica
135           7.7          3.0           6.1          2.3  Iris-virginica
136           6.3          3.4           5.6          2.4  Iris-virginica
139           6.9          3.1           5.4          2.1  Iris-virginica
140           6.7          3.1           5.6          2.4  Iris-virginica
141           6.9          3.1           5.1          2.3  Iris-virginica
143           6.8          3.2           5.9          2.3  Iris-virginica
144           6.7          3.3           5.7          2.5  Iris-virginica
145           6.7          3.0           5.2          2.3  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica

In [185]:
# Challenge 4c
# ---
# Question: Which observations had items outlet sales greater than 2000?
# ---
# Dataset url = https://bit.ly/ShoprityDS
# ---
# OUR CODE GOES BELOW
#

In [186]:
# Example 5d
# ---
# We can also use the query method to get for data where petal_width is equal to 1.0
# Once you run this cell, replace the equals operator == to with less than < 
# or greater than > operators to see their applications as well.
# ---
# The parameter inplace makes changes in the original dataframe if True.
# We should also note the query method works if the column name doesnâ€™t have any empty spaces.
# Hence the need replace blank spaces in our column names with '_'
# ---
#  

# Let's filter our data
#
iris_df.query('petal_width == 1.9', inplace = True) 

# Previewing our dataset 
iris_df.head()

     sepal_length  sepal_width  petal_length  petal_width         species
101           5.8          2.7           5.1          1.9  Iris-virginica
111           6.4          2.7           5.3          1.9  Iris-virginica
130           7.4          2.8           6.1          1.9  Iris-virginica
142           5.8          2.7           5.1          1.9  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica

In [174]:
iris_df['petal_width'] = iris_df.loc[(iris_df['petal_width'] == 1.9)]

In [175]:
iris_df

     sepal_length  sepal_width  petal_length petal_width         species
101           5.8          2.7           5.1         5.8  Iris-virginica
111           6.4          2.7           5.3         6.4  Iris-virginica
130           7.4          2.8           6.1         7.4  Iris-virginica
142           5.8          2.7           5.1         5.8  Iris-virginica
146           6.3          2.5           5.0         6.3  Iris-virginica

In [157]:
iris_df.shape

(150, 5)

In [187]:
# We can also perform multiple condition filtering as shown below
# ---
#

iris_df.query('sepal_width == 2.7 and petal_length == 5.1', inplace = True) 

# Previewing our dataset 
iris_df.head()

     sepal_length  sepal_width  petal_length  petal_width         species
101           5.8          2.7           5.1          1.9  Iris-virginica
142           5.8          2.7           5.1          1.9  Iris-virginica

In [64]:
# Challenge 5d
# ---
# Question: Which observations had items outlet sales greater than 2000 and less than 3000?
# ---
# Dataset url = https://bit.ly/ShoprityDS
# ---
# OUR CODE GOES BELOW
#

## 9. Sorting

#### <font color="blue">Examples</font>

In [188]:
# Example 5a
# --- 
# Load the given dataframe in ascending order by reports 
# ---
# OUR CODE GOES BELOW
# 
 
# Sorting our dataset in ascending order by sepal_length
# ---
# 
iris_df.sort_values(by='sepal_length', ascending=1)

     sepal_length  sepal_width  petal_length  petal_width         species
101           5.8          2.7           5.1          1.9  Iris-virginica
142           5.8          2.7           5.1          1.9  Iris-virginica

#### <font color="green">Challenges</font>

In [189]:
# Challenge 5a 
# --- 
# Sort items by weight in descending order given the following dataset.
# Hint: ascending = 0 
# ---
# Dataset url = https://bit.ly/ShoprityDS
# ---
# OUR CODE GOES BELOW
#

## 10. Splitting, Merging and Concatenation

#### <font color="blue">Examples & Challenges</font>

In [200]:
new_iris_df = iris_df["species"].str.split("-", n = 1, expand = True)

In [201]:
new_iris_df

        0          1
101  Iris  virginica
142  Iris  virginica

In [202]:
# Example 6a
# --- 
# Split the dataframe species column into two columns by using the "-" character
# ---
# OUR CODE GOES BELOW
# 
 
# Dropping null value columns to avoid errors 
iris_df.dropna(inplace = True) 
  
# New data frame with split value columns 
new_iris_df = iris_df["species"].str.split("-", n = 1, expand = True) 
  
# Naking separate first name column from new data frame 
iris_df["family"]= new_iris_df[0] 
  
# Making separate last name column from new data frame 
iris_df["sub-species"]= new_iris_df[1] 
  
# Dropping old Name columns 
iris_df.drop(columns =["species"], inplace = True) 
  
# Displaying our dataframe
iris_df

     sepal_length  sepal_width  petal_length  petal_width family sub-species
101           5.8          2.7           5.1          1.9   Iris   virginica
142           5.8          2.7           5.1          1.9   Iris   virginica

In [68]:
# Example 2
# ---
# Concatenating (merging) two columns in a dataframe
# ---  
# OUR CODE GOES BELOW
# 

# Concatenating our column
# 
iris_df['species'] = iris_df['family'].str.cat(iris_df['sub-species'],sep="-")

# Dropping old name columns 
#
iris_df.drop(columns = ["family", "sub-species"], inplace = True) 

# Previewing our new dataframe
#
iris_df.head()

     sepal_length  sepal_width  petal_length  petal_width         species
101           5.8          2.7           5.1          1.9  Iris-virginica
142           5.8          2.7           5.1          1.9  Iris-virginica

In [69]:
# Challenge 6a
# --- 
# Concatenate the the city and state columns from the dataset below. 
# The resulting region column should have city and state seperated by a comma and whitespace.
# ---
# Dataset url = http://bit.ly/SchoolShootingsDataset
# ---
# Step 1: Load the dataset
# Step 2: Preview the dataset 
# Step 3: Perform your concatenation
# Step 4: Dropping old columns
# Step 4: Preview your final dataframe
# ---
# OUR CODE GOES BELOW
#

In [204]:
# Example 6b
# ---
# Merging two dataframes. 
# In this example, we will create two simple dataframes for demonstration purposes.
# ---  
# OUR CODE GOES BELOW
# 

# Let's create our first dataframe and preview it
# 
df1 = pd.DataFrame([[2, 3], [41, 51]], columns=['a', 'b'])
df1.head()

    a   b
0   2   3
1  41  51

In [205]:
 # Let our second dataframe and preview it
#
df2 = pd.DataFrame([[2, 5], [41, 6]], columns=['a', 'c'])
df2.head()

    a  c
0   2  5
1  41  6

In [213]:
# Merging our dataframes and storing our resulting dataframe in df3, then previewing it 
# 
df3 = df1.merge(df2, how='left', on='a') 
df3.head()

    a   b  c
0   2   3  5
1  41  51  6

In [214]:
# Merging our dataframes and storing our resulting dataframe in df3, then previewing it 
# 
df4 = df1.merge(df2, how='right', on='a') 
df4.head()

    a   b  c
0   2   3  5
1  41  51  6

In [73]:
# Challenge 6b
# --- 
# Merge the following two datasets
# ---
# Dataset 1 url = http://bit.ly/CitiesDataset
# Dataset 2 url = http://bit.ly/CountriesDataset1
# ---
# OUR CODE GOES BELOW
#

## 11. Outliers

#### <font color="blue">Examples</font>

In [74]:
# Example 1
# --- 
# Given the following dataset, find and deal with outliers.
# ---
# Dataset url = http://bit.ly/CountryDataset1
# ---
# OUR CODE GOES BELOW
#  

# Let's read data from url as dataframe
# 
outliersc_df = pd.read_csv("http://bit.ly/CountryDataset1") 

# Lets preview our our dataframe below
#
outliersc_df.head()

       country  year         pop continent  lifeExp   gdpPercap
0  Afghanistan  1952   8425333.0      Asia   28.801  779.445314
1  Afghanistan  1957   9240934.0      Asia   30.332  820.853030
2  Afghanistan  1962  10267083.0      Asia   31.997  853.100710
3  Afghanistan  1967  11537966.0      Asia   34.020  836.197138
4  Afghanistan  1972  13079460.0      Asia   36.088  739.981106

In [75]:
# Checking the size of our dataset for cleaning purposes
# ---
#
outliersc_df.shape

(1704, 6)

In [76]:
# There are many ways of dealing with the outliers however in this session we wiil 
# use the interquartile range (IQR). 
# A data point is considered to be an outiler if it is more 
# than 1.5 * IQR above the third quartile (i.e. Q3  + 1.5 * IQR) 
# or below the first quartile (i.e. Q1 - 1.5 * IQR). 
# If we were to use a box plot visualisation then,
# we would be able to visually see those values outside this range. 
# Something to note is that this method will consider only the numerical values in 
# our dataset. Lets now calculate the IQR for each column.
# ---
#

# We first defining our quantiles using the quantile() function
# ---
# 
Q1 = outliersc_df.quantile(0.25)
Q3 = outliersc_df.quantile(0.75)
IQR = Q3 - Q1
IQR

# Then filtering out our outliers by getting values which are outside our IQR Range.
# ---
#
outliers_df_iqr = outliersc_df[((outliersc_df < (Q1 - 1.5 * IQR)) | (outliersc_df > (Q3 + 1.5 * IQR))).any(axis=1)]

# Checking the size of the dataset with outliers for cleaning purposes
# ---
#
outliers_df_iqr.shape

(317, 6)

In [77]:
# We can also explore our outliers by doing the following
# ---
# 
outliers_df_iqr

        country  year         pop continent  lifeExp     gdpPercap
67    Australia  1987  16257249.0   Oceania   76.320  21888.889030
68    Australia  1992  17481977.0   Oceania   77.560  23424.766830
69    Australia  1997  18565243.0   Oceania   78.830  26997.936570
70    Australia  2002  19546792.0   Oceania   80.370  30687.754730
71    Australia  2007  20434176.0   Oceania   81.235  34435.367440
...         ...   ...         ...       ...      ...           ...
1651    Vietnam  1987  62826491.0      Asia   62.820    820.799445
1652    Vietnam  1992  69940728.0      Asia   67.662    989.023149
1653    Vietnam  1997  76048996.0      Asia   70.672   1385.896769
1654    Vietnam  2002  80908147.0      Asia   73.017   1764.456677
1655    Vietnam  2007  85262356.0      Asia   74.249   2441.576404

[317 rows x 6 columns]

In [78]:
# Lastly, the most common method of handling our outliers is to drop them.
# In some cases we can:
# 1. Leave them if they are genuine
# 2. Replace them with values within the IQR range
# 3. Drop them
# ---
# In our case, we will drop them.
# We just use the "~" character to refer to the other part of the dataset that 
# does not have outliers
# ---
# 
clean_dfc_iqr = outliersc_df[~((outliersc_df < (Q1 - 1.5 * IQR)) | (outliersc_df > (Q3 + 1.5 * IQR))).any(axis=1)]

# Checking the size of our final dataset.
clean_dfc_iqr.shape

(1387, 6)

#### <font color="green">Challenges</font>

In [79]:
# Challenge 1
# ---
# Question: Find and Deal with the outliers in the given df dataframe.
# ---
# Dataset url = http://bit.ly/DataCleaningDataset
# You can use the df dataframe you created ealier on.
# ---
# OUR CODE GOES BELOW
#

## 12. Exporting Data

#### <font color="blue">Examples & Challenges</font>

In [80]:
# Pre-requisite 7
# ---
# Importing files module 
# ---
# OUR CODE GOES BELOW
#  

# Files module will allow us to download our file from colaboratory
from google.colab import files

ModuleNotFoundError: No module named 'google.colab'

In [81]:
# Example 7a
# --- 
# Load the given dataframe in ascending order by reports 
# ---
# OUR CODE GOES BELOW
# 
  
# Create our sample dataframe
data = {'name': ['Daniel', 'Joyce', 'Elizabeth', 'Sanni', 'Sefu'], 
        'year': [2012, 2012, 2013, 2014, 2014], 
        'reports': [4, 24, 31, 2, 3]}
df = pd.DataFrame(data, index = ['Nairobi', 'Cairo', 'Cape Town', 'Adis Ababa', 'Mombasa'])
df.head()

                 name  year  reports
Nairobi        Daniel  2012        4
Cairo           Joyce  2012       24
Cape Town   Elizabeth  2013       31
Adis Ababa      Sanni  2014        2
Mombasa          Sefu  2014        3

In [82]:
# Exporting our sample dataframe as a csv
# ---
# 
 
df.to_csv('example.csv') 

# NB: In order to download our files from colaboratory we need to run the following
#
files.download('example.csv')

NameError: name 'files' is not defined

In [83]:
# Challenge 7a
# ---
# Question: Export a csv file of your resulting shoprity dataframe below 
# --- 
# OUR CODE GOES BELOW
#

In [84]:
# Example 7b
# ---
# Exporting our sample dataframe as a excel file (xlsx)
# --- 
# ---
# OUR CODE GOES BELOW
#  

df.to_excel('example.xlsx') 

# NB: In order to download our files from colab we need to run the following
#
files.download('example.xlsx')

NameError: name 'files' is not defined

In [ ]:
# Challenge 7b
# ---
# Question: Export a excel file of your resulting shoprity dataframe
# --- 
# OUR CODE GOES BELOW
#